{
  "posts": [
    {
      "id": "76bd",
      "autor": "Afonso",
      "titulo": "Programação: 5 profissões que exigem saber programar",
      "categoria": "Tecnologia",
      "imagem": "https://idocode.com.br/wp-content/uploads/2021/07/programacao-1024x684.jpg.webp",
      "conteudo": "Há diversas oportunidades no mercado de trabalho para profissionais que sabem tudo de programação e, acredite, algumas delas foram feitas especialmente para as crianças e adolescentes de hoje. Vamos falar sobre elas?",
      "data": "2025-11-20T18:30:00.029Z"
    },
    {
      "id": "b645",
      "autor": "Afonso",
      "titulo": "GitHub lista as linguagens de programação que mais crescem",
      "categoria": "Tecnologia",
      "imagem": "https://midias.inforchannel.com.br/wp-content/uploads/2023/02/Github-Top-10-linguagens-de-programacao-768x432.jpg.webp",
      "conteudo": "Em um mundo moderno cada vez mais dependente de plataformas digitais, profissionais de programação estão vendo crescer sua demanda e, com ela, a variedade de particularidades de cada projeto. Em 2022, GitHub viu mais de 20 milhões de novas pessoas juntarem-se à plataforma, alcançando agora 100 milhões de pessoas desenvolvedoras em todo o todo o mundo. O Brasil está entre os países com maior crescimento na plataforma e registrou quase um milhão de novas pessoas desenvolvedoras no último ano, ou seja, uma em cada 10 dessas que se juntaram ao GitHub em 2022 é brasileira.",
      "data": "2025-11-20T18:30:34.854Z"
    },
    {
      "id": "4e2b",
      "autor": "Afonso",
      "titulo": "10 Curiosidades informáticas y tecnológicas que debes conocer",
      "categoria": "Informática",
      "imagem": "https://supercurioso.com/wp-content/uploads/2023/06/curiosidades-tecnologicas-e-informaticas.jpg",
      "conteudo": "En el mundo digital, las empresas deben mantenerse al día en las tendencias y datos relevantes que resignifiquen el entorno y les permitan ser competitivas y eficientes dentro del mismo. Lo anterior aplica para toda clase de negocios. Además, estos datos ayudarán a que el cliente se interese en las ventajas de los avances tecnológicos y descubra en ellos posibilidades de crecimiento y éxito.",
      "data": "2025-11-20T18:33:07.874Z"
    },
    {
      "id": "7ec9",
      "autor": "Afonso",
      "titulo": "Os Avanços Tecnológicos Provocaram Mudanças Na Sociedade",
      "categoria": "Tecnologia",
      "imagem": "https://tse4.mm.bing.net/th?id=OIP.VWYL3Z4HTUEBW7PYVbPdAAHaD2&pid=15.1",
      "conteudo": "Weba quarta revolução tecnológica está em andamento e é caracterizada pela inteligência artificial, robótica, internet das coisas e outras tecnologias avançadas. A tecnologia tem impactado profundamente a economia, gerando novas indústrias e transformando as existentes. A tecnologia também tem impactado a sociedade, mudando a forma como. Webo impacto da tecnologia na sociedade atual:",
      "data": "2025-11-20T18:34:04.428Z"
    },
    {
      "id": "9217",
      "autor": "Afonso",
      "titulo": "Consecuencias de un mundo avanzado en la tecnología",
      "categoria": "Tecnologia",
      "imagem": "https://alphaenginyeria.com/wp-content/uploads/2024/01/Tendencias-Tecnologicas-2024-Las.webp",
      "conteudo": "Un mundo avanzado en tecnología trae consigo una serie de consecuencias que afectan diferentes aspectos de la vida cotidiana, la economía, la sociedad y el medio ambiente. Aquí hay algunas de las más significativas:",
      "data": "2025-11-20T18:37:00.963Z"
    },
    {
      "id": "05b0",
      "autor": "Afonso",
      "titulo": "A História da Tecnologia Blockchain: Conheça sua Timeline",
      "categoria": "Tecnologia",
      "imagem": "https://101blockchains.com/wp-content/uploads/2018/12/historia-de-la-tecnolog%C3%ADa-blockchain.png.webp",
      "conteudo": "Como surgiu a blockchain? Stuart Haber e W. Scott Stornetta imaginaram o que muitas pessoas passaram a conhecer como blockchain, em 1991.\nInicialmente o primeiro projeto envolveu a criação em uma rede de blocos protegidos criptograficamente, onde ninguém poderia adulterar o registro de data e hora dos documentos.",
      "data": "2025-11-20T18:37:48.469Z"
    },
    {
      "id": "c46d",
      "autor": "Afonso",
      "titulo": "A comunicação no mundo digital",
      "categoria": "Tecnologia",
      "imagem": "https://img.jaenoticia.com.br/mXK1L7_g9tXInf8Zhs24x2YqHHo=/736x431/smart/s3.jaenoticia.com.br/uploads/imagens/blog_1477.jpeg",
      "conteudo": "Neste período de pandemia e isolamento social tivemos que gerar transformação nas nossas vidas. Nossa rotina e costumes não são mais os mesmos, mudamos repentinamente pela necessidade, pois novas habilidades e competência tivemos que desenvolver para seguir nosso dia a dia cheio de informações e novas formas de comunicação digital.",
      "data": "2025-11-20T18:38:22.217Z"
    },
    {
      "autor": "Afonso Filho",
      "titulo": "Inteligencia artificial, robótica y mujeres: una nueva revolución",
      "categoria": "Tecnologia",
      "imagem": "https://www.clarin.com/img/2018/10/03/PV6KmBOO4_1256x620__1.jpg",
      "conteudo": "Las nuevas tecnologías están cambiando rápidamente el mundo que conocemos y avanzan mucho más rápido que los cambios sociales, jurídicos y hasta que nuestra propia capacidad de asimilarlos.",
      "data": "2025-11-20T18:39:17.019Z",
      "id": "e9f7"
    },
    {
      "id": "6d83",
      "autor": "Luiz Thomas",
      "titulo": "Por que estudar informática?",
      "categoria": "Informática",
      "imagem": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhUDdR0ZT8j6zT2tVU4JkvScpRT7-7krDkfrEl18Pmr3TkblpOD_lb7n_7p5ujLGEcjHHTEZiCv8R8brLqbtxtP_CBjUhgSyEo5CD5karHbCjynSOp_aOTxSwZDPhwhfdcCux1KjsV71aQW/s400/informatica.jpg",
      "conteudo": "Com o passar dos anos, a informática acabou adquirindo cada vez mais importância, não só na vida das pessoas como nas empresas. Sua utilização pode ser vista como utensílio de aprendizagem e sua ação no meio social vêm aumentando de forma rápida entre as pessoas\n\nTer um curso de informática em seu currículo irá te oferecer muitas vantagens. Isso porque, quanto mais conhecimento você tiver na área, mais serão as chances de se destacar nos processos de seleção que são mais concorridos.",
      "data": "2025-11-26T13:45:56.105Z"
    },
    {
      "id": "2337",
      "autor": "Luiz Thomas",
      "titulo": "O que é computação?",
      "categoria": "Informática",
      "imagem": "https://conceitosdomundo.pt/wp-content/uploads/2021/10/informatica.jpg",
      "conteudo": "Informática ou computação é a ciência que estuda os métodos e técnicas de armazenamento, processamento e transmissão de informações de forma automatizada e, mais especificamente, em formato digital por meio de sistemas informatizados.\n\nNa verdade, não existe uma definição única e universal do que seja a computação, talvez por ser uma das ciências de origem mais recente, embora de desenvolvimento mais rápido e desenfreado.",
      "data": "2025-11-26T13:46:30.504Z"
    },
    {
      "id": "38b9",
      "autor": "Luiz Thomas",
      "titulo": "Informática: Tudo o que você precisa saber",
      "categoria": "Informática",
      "imagem": "https://mestresdainformatica.com.br/wp-content/webp-express/webp-images/uploads/2022/05/Tudo-o-que-voce-precisa-saber-sobre-informatica.png.webp",
      "conteudo": "A computação é um campo de informação digital que inclui o processo de coleta, armazenamento, processamento, transmissão e disseminação de dados.\n\n\nO termo é uma combinação das palavras informação e automático e, portanto, pode ser generalizado para informação processada por meios automáticos.\n\nA tecnologia da informação e suas inovações e seus dispositivos fazem parte de todas as esferas de nossas vidas, ferramentas de trabalho, estudo e lazer.",
      "data": "2025-11-26T13:47:09.493Z"
    },
    {
      "id": "9b52",
      "autor": "Luiz Thomas",
      "titulo": "Informática Básica: Guia Completo de tudo o que você precisa saber",
      "categoria": "Informática",
      "imagem": "https://cursoseducaweb.com.br/images/blog/informatica-basica-2.JPG",
      "conteudo": "A tecnologia é o ponto principal do mercado, da sociedade e da cultura na era digital. Dessa forma, sem o conhecimento fundamental dessa área, torna-se difícil acompanhar as mudanças do mundo e participar dos setores profissionais.\n\nPor isso, é necessário aprender os conceitos e práticas essenciais da informática. Assim, neste artigo você descobrirá um guia completo sobre o assunto e conhecerá um curso online gratuito de excelência para se formar. Acompanhe a leitura!",
      "data": "2025-11-26T13:47:57.060Z"
    }
  ]
}